//==============================================================================
//     file name  : SPI.c
//==============================================================================

//------------------------------------------------------------------------------
//	Include file and variable
//------------------------------------------------------------------------------

#define  MyDef  extern					// MyDef means external variable
#include "Global.h"				        //

//------------------------------------------------------------------------------
//	external prototype function
//------------------------------------------------------------------------------

extern void	Wait_uSec(Word);		    //

//==============================================================================
//	SM1668 SIO interface
//==============================================================================
//------------------------------------------------------------------------------
//    task  : Delay n cycle x 238.66ns@4.19MHz
//------------------------------------------------------------------------------
void Delay_1us(void)
{                                       //lcall+ret       2+2
  _nop_();                              //nop             1
}                                       //          total 5cycle x 238.66ns = 1.1933us
//------------------------------------------------------------------------------
//	task  : SIO 1 Byte Write
//------------------------------------------------------------------------------
void Write_Byte(Byte DAT)
{     
    Byte k, buf;
    
    P3IO |= 0x02;                       // output P31
    buf = DAT;                          //
    for(k=0;k<8;k++)                    //
    {   if(buf & 0x80)                  // msb first
              p_SIO = HIGH;             // p_SIO data high out
        else  p_SIO = LOW;              // p_SIO data low  out
        buf <<= 1;                      // 
        p_SCLK = HIGH;                  // sclk out
        Delay_1us();                    //
        p_SCLK = LOW;                   //
    }
}
//------------------------------------------------------------------------------
//	task  : SIO 1 Byte Read
//------------------------------------------------------------------------------
Byte Read_Byte(void)
{
    Byte k,dt=0;                        //
    
    P3IO &= 0xFD;                       // input P31
    for(k=0;k<8;k++)                    //
    {   dt <<= 1;                       //
        p_SCLK = HIGH;                  // SCLK out
        Delay_1us();                    //
        p_SCLK = LOW;                   //
        if(P3&0x02)                     // p_SIO read P31
            dt |= 0x01;                 //
    }
    return dt;                          //
}
//------------------------------------------------------------------------------
//  task    : SM1688 Command + Data packet read/write
//  input   : f_Tx = 0 이면  키스캔 정보 읽어오기 
//            f_Tx = 1 이면  LED 표시정보 내보내기
//------------------------------------------------------------------------------
void RdWr_1688(Byte CMD, Byte CNT, Byte *DAT)
{
    Byte  k;                            //
    
    p_STB = LOW;                        // strobe enable (low)
    Delay_1us();                        //
    
    Write_Byte(CMD);                    // 명령어 보내기
    
    if(CNT)                             //
    {   for(k=0;k<CNT;k++)              //
        {   if(f_Tx)                    // 읽어오기/내보내기 ?
                 Write_Byte(*DAT++);    // 데이터 1 바이트 내보내기
            else *DAT++=Read_Byte();    // 데이터 1 바이트 읽어오기
        }
    }
    
    Delay_1us();                        //
    p_STB = HIGH;                       // strobe disable (high)
}

//==============================================================================
