//***************************************************************************
//!
//! \file    TimeFlag.c
//! \brief   型号:HCA22090R(WiFi) MCU:27E62
//! \version V1.0
//! \author  D.H.
//! \date    2014-11-01
//! \email   danghao0815@163.com
//!
//***************************************************************************

#include "timeflag.h"

u8	num250us;
u8	num10ms;
u8	num50ms;

bit f10ms;		
bit f10ms_2;		
bit f1_50ms;
bit f2_50ms;
bit f_500ms;
	
//***************************************************************************
//! \brief       时间标志函数 
//! \param       无
//! \return      无
//***************************************************************************
void TimeFlag (void)
{
	if(f025ms)
	{
		f025ms = 0;
		num250us ++;
		if(num250us == 40)
		{
			num250us =	0;
			f10ms	=	1;
			f10ms_2 =	1;
			num10ms ++;
			if(num10ms == 5)
			{
				num10ms = 0;
				f2_50ms = 1;
				f1_50ms = 1;
				num50ms++;
				if(num50ms == 10)
				{
					num50ms = 0;
					f_500ms = 1;
				}
			}
		}
	}
}
