//***************************************************************************
//!
//! \file   main.c
//! \brief  型号:FSA4062R MCU:27E62
//! \author D.H.
//! \date   2014-12-01
//! \email  danghao0815@163.com
//!
//***************************************************************************

#include "initial.h"
#include "timer.h"
#include "rec.h"
#include "led.h"
#include "key.h"
#include "buzzer.h"
#include "fun.h"

bit f_t0;
bit buz_en;

//***************************************************************************
//! \brief       main函数
//***************************************************************************
void main(void)
{
	WDTR = 0x5A;
	STKP |= 0x07;
	initial();		// 系统初始化
	while(1)
	{
		WDTR = 0x5A;
		time_flag();
		timer();	// 时间处理
		key();		// 按键处理
		led();		// led显示
		buzzer();	// 蜂鸣器处理
		rec();		// 红外接收
		fun();
	}
}

//***************************************************************************
//! \brief       T0中断函数
//***************************************************************************
void __interrupt [0x08] isr_t0(void)
{
	FT0IRQ = 0;
	T0C=0xCC;
	if(buz_en)
	FP46 = ~FP46;
	f_t0 = 1;
}

